#+title: Class Notes
#+startup: indent overview hideblocks entitiespretty

* Week 11 - Fnal Project Wireframe
- Features your site needs, your goal to solve student pain points on campus...
  1. Some study tools
     - [[https://webdesign.tutsplus.com/create-a-pomodoro-timer-with-html-css-and-vanilla-javascript--cms-108069t][Pomodoro Timer]]
     - Links to helpful pages for various subjects
       1. Math
          - [[https://openstax.org/][OpenStax]]
          - [[https://www.geogebra.org/graphing?lang=en][Online Graphing Calculator]]
          - [[https://tutorial.math.lamar.edu/Classes/CalcI/CalcI.aspx][Paul's  Online Calculus Notes]]
          - [[https://www.sagemath.org/][Sage Math]]

       2. English/Literature
          - [[https://owl.purdue.edu/][Purdue OWL (Writing)]]
          - [[https://www.zotero.org/][Zotero]]
          - [[https://standardebooks.org/][Standard Ebooks (Free)]]
          - [[https://www.gutenberg.org/][Project Gutenberg]]

       3. Computer Science
          - [[https://en.wikibooks.org/wiki/LaTeX][LaTex Docs]]
          - [[https://git-scm.com/book/en/v2][Git Documentation]]
          - [[https://numpy.org/doc/stable/user/index.html#user][Numpy Docs]]
          - [[https://matplotlib.org/stable/users/index][Matplotlib Docs]]
          - [[https://cheatography.com/tag/math/][Cheatsheets]]
          - [[https://fosswire.com/post/2007/08/unixlinux-command-cheat-sheet/][Linux Terminal Cheet Sheet]]
          - [[https://docs.python.org/3/reference/index.html][Python Quick Reference]]

       4. History
          - [[https://www.loc.gov/collections/][Library of Congress Digital Collection]]
          - [[https://www.archives.gov/research][National Archives]]
          - [[https://sourcebooks.fordham.edu/][Internet History Sourcebooks]]
          - [[https://www.europeana.eu/][Europeana]]
          - [[https://archive.org/][Archive.org]]
          - [[https://www.timemaps.com/][World History Timeline]]

       5. Economics
          - [[https://www.core-econ.org/][The Economy - Open Textbook]]
          - [[https://www.khanacademy.org/economics-finance-domain][Kahn Academy Economics]]
          - [[https://ourworldindata.org/][Our World in Data]]
          - [[https://fred.stlouisfed.org/][Federal Reserve Economic Data]]
          - [[https://www.econometrics-with-r.org/][Econometrics with R]]

       6. Data Science
          - [[https://github.com/matloff/fasteR][FasteR (R lang)]]
          - [[https://www.youtube.com/user/joshstarmer][StatQuest stats, ML, AI explained visually]]
          - [[https://datasetsearch.research.google.com/][Google Dataset Search]]

  2. APIs:
     - [[https://open-meteo.com/en/docs][Open Meteo Forecast]]
     - [[https://docs.zenquotes.io/zenquotes-documentation/][Zen Quotes]] - Inspirational quote of the day
       #+begin_src python :results output
       import requests

       url = "https://zenquotes.io/api/random"
       response = requests.get(url)

       json_data = response.json()

       quote = json_data[0].get("q")
       author = json_data[0].get("a")

       print(f"{quote}\n\t--{author}")
       #+end_src

       #+RESULTS:
       : Never trust he who trusts everyone.
       : 	--Carlos Ruiz Zafon

- Wireframe of 3 or more pages for the site
- "MVP" version of the site?
